Impeller/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

12
(
    stationaryWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          640;
        startFace       26162;
    }
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       26802;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       26962;
    }
    cyclicIn1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       27122;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicIn2;
    }
    cyclicIn2
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       27222;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicIn1;
    }
    cyclicRepeatAMIIn1
    {
        type            cyclicRepeatAMI;
        inGroups        List<word> 1(cyclicRepeatAMI);
        nFaces          160;
        startFace       27322;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicRepeatAMIIn2;
        method          faceAreaWeightAMI;
        transformPatch  cyclicIn1;
    }
    cyclicRepeatAMIIn2
    {
        type            cyclicRepeatAMI;
        inGroups        List<word> 1(cyclicRepeatAMI);
        nFaces          187;
        startFace       27482;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicRepeatAMIIn1;
        method          faceAreaWeightAMI;
        transformPatch  cyclicIn1;
    }
    cyclicOut1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       27669;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicOut2;
    }
    cyclicOut2
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       27769;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicOut1;
    }
    cyclicRepeatAMIOut1
    {
        type            cyclicRepeatAMI;
        inGroups        List<word> 1(cyclicRepeatAMI);
        nFaces          187;
        startFace       27869;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicRepeatAMIOut2;
        method          faceAreaWeightAMI;
        transformPatch  cyclicIn1;
    }
    cyclicRepeatAMIOut2
    {
        type            cyclicRepeatAMI;
        inGroups        List<word> 1(cyclicRepeatAMI);
        nFaces          160;
        startFace       28056;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicRepeatAMIOut1;
        method          faceAreaWeightAMI;
        transformPatch  cyclicIn1;
    }
    movingWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1848;
        startFace       28216;
    }
)

// ************************************************************************* //
